text="""Садок вишневий коло хати,
Хрущі над вишнями гудуть,
Плугатарі з плугами йдуть,

Співають ідучи дівчата,
А матері вечерять ждуть.
Сім’я вечеря коло хати,

Вечірня зіронька встає.
Дочка вечерять подає,
А мати хоче научати,

Так соловейко не дaє.
Поклала мати коло хати
Маленьких діточок своїх;

Сама заснула коло їх.
Затихло все, тілько дівчата
Та соловейко не затих біля хати.
"""
print(f'Кількість слів "хати" => {text.count("хати")}')

# text.find("хати")
index_word=text.find("хати")
# print("index_word=>",index_word)
count=0

while index_word!=-1:
    count+=1
    if count==3:
        print("index third word=>",index_word)
    print(f"індекс {count}-го слова =>",index_word)
    index_word=text.find("хати",index_word+1)
else:
    print("Пошук завершено!")


s1="  Text "
print(s1.strip())
print(s1)


"""
Напишіть програму, яка приймає від користувача рядок, 
і відображає цей рядок у верхньому і нижньому регістрах.
"""
"""
306. Напишіть програму, яка виводить на екран рядок
з 5-ти копій останніх двох символів введеного користувачем рядка (довжина введеного рядка повинна бути не менше 2).
"""

text=input("input text:")
print(text[-2:]*5)